In [62]:
import pandas as pd
import numpy as np

In [63]:
data1=pd.read_csv('Bengaluru_House_Data.csv')

In [64]:
data1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [65]:
data1.shape

(13320, 9)

In [66]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [67]:
#print(data1.columns)
for col in data1.columns:
    print(data1[col].value_counts())
    print("*"*20)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
********************
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: availability, Length: 81, dtype: int64
********************
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64
********************
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64
********************
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Amionce     1
JaghtDe     1
Jauraht     1
Brity U     1
RSntsAp     1
Name: society, Length: 2688, dtype: int64
********************
1200    843
1100    221
1500    205
2400    196
600     180
       ...
3580      1
2461      1
1437      1
2155      1
4689      1
Name: total_sqft, Length: 2117, dtype: int64
********************
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: bath, dtype: int64
********************
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
********************
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
351.00      1
54.10       1
80.64       1
32.73       1
488.00      1
Name: price, Length: 1994, dtype: int64
********************

In [68]:
data1.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [69]:
data1.drop(columns=['area_type','availability','society','balcony'],inplace=True)

In [70]:
data1.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [71]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [72]:
data1['location'].value_counts()

Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64

In [73]:
data1['location']=data1['location'].fillna('Sarjapur Road')

In [74]:
data1['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64

In [75]:
data1['size']=data1['size'].fillna('2 BHK')

In [76]:
data1['bath'].value_counts()

2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: bath, dtype: int64

In [77]:
data1['bath']=data1['bath'].fillna(data1['bath'].median())

In [78]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [79]:
data1['bhk']=data1['size'].str.split().str.get(0).astype(int)

In [80]:
data1[data1.bhk>20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [81]:
data1['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [82]:
def convertRange(x):
    temp=x.split('-')
    if len(temp) == 2:
        return (float(temp[0])) + float(temp[1])/2
    try:
        return float(x);
    except:
        return None;

In [83]:
data1['total_sqft']=data1['total_sqft'].apply(convertRange)

In [84]:
data1.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [85]:
data1['price_per_sqft']=data1['price']*100000/data1['total_sqft']

In [86]:
data1['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13320, dtype: float64

In [87]:
data1.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1572.225941      2.688814    112.565627      2.802778    7.883254e+03
std     1254.823072      1.338754    148.971674      1.294496    1.064303e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.227642e+03
50%     1280.000000      2.000000     72.000000      3.000000    5.416667e+03
75%     1690.000000      3.000000    120.000000      3.000000    7.293505e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [88]:
data1['location'].value_counts()

Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Uvce Layout                         1
Abshot Layout                       1
Name: location, Length: 1306, dtype: int64

In [89]:
data1['location']=data1['location'].apply(lambda x:x.strip())
location_count=data1['location'].value_counts()

In [90]:
location_count_less10=location_count[location_count<=10]
location_count_less10

BTM 1st Stage                         10
Nagadevanahalli                       10
Basapura                              10
Sector 1 HSR Layout                   10
Dairy Circle                          10
                                      ..
1Channasandra                          1
Hosahalli                              1
Vijayabank bank layout                 1
near Ramanashree California resort     1
Abshot Layout                          1
Name: location, Length: 1054, dtype: int64

In [91]:
data1['location']=data1['location'].apply(lambda x: 'other' if x in location_count_less10 else x)

**Outlier detection and removal**

In [92]:
data1.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1572.225941      2.688814    112.565627      2.802778    7.883254e+03
std     1254.823072      1.338754    148.971674      1.294496    1.064303e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.227642e+03
50%     1280.000000      2.000000     72.000000      3.000000    5.416667e+03
75%     1690.000000      3.000000    120.000000      3.000000    7.293505e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [93]:
(data1['total_sqft']/data1['bhk']).describe()

count    13274.000000
mean       579.732987
std        392.247238
min          0.250000
25%        475.000000
50%        554.000000
75%        627.500000
max      26136.000000
dtype: float64

In [94]:
data1=data1[((data1['total_sqft']/data1['bhk'])>=300)]
data1.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12530.000000  12530.000000  12530.000000  12530.000000    12530.000000
mean    1607.911902      2.559537    111.382401      2.650838     6278.292738
std     1277.977557      1.077938    152.077329      0.976678     4171.053803
min      300.000000      1.000000      8.440000      1.000000      267.829813
25%     1120.000000      2.000000     49.000000      2.000000     4177.777778
50%     1302.500000      2.000000     70.000000      3.000000     5273.281068
75%     1710.000000      3.000000    115.000000      3.000000     6896.551724
max    52272.000000     16.000000   3600.000000     16.000000   176470.588235

In [95]:
data1.shape

(12530, 7)

In [96]:
data1.price_per_sqft.describe()

count     12530.000000
mean       6278.292738
std        4171.053803
min         267.829813
25%        4177.777778
50%        5273.281068
75%        6896.551724
max      176470.588235
Name: price_per_sqft, dtype: float64

In [97]:
#print(data1.groupby('location'))

In [98]:
def remove_out_sqft(df):
    df_out=pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m=np.mean(subdf.price_per_sqft)
        st=np.std(subdf.price_per_sqft)
        gen_df=subdf[(subdf.price_per_sqft>(m-st))&(subdf.price_per_sqft<=(m+st))]
        df_out=pd.concat([df_out,gen_df],ignore_index=True)
    return df_out
data1=remove_out_sqft(data1)
data1.describe()

         total_sqft         bath         price           bhk  price_per_sqft
count  10287.000000  10287.00000  10287.000000  10287.000000    10287.000000
mean    1517.904648      2.47176     91.305304      2.575872     5641.654913
std      903.645032      0.97517     86.528904      0.895390     2270.194350
min      300.000000      1.00000     10.000000      1.000000     1250.000000
25%     1110.000000      2.00000     49.000000      2.000000     4210.526316
50%     1290.000000      2.00000     67.000000      2.000000     5159.705160
75%     1650.000000      3.00000    100.000000      3.000000     6412.588374
max    30400.000000     16.00000   2200.000000     16.000000    24509.803922

In [99]:
def bhk_outlier_remover(df):
    exclude_indices=np.array([])
    for location,location_df in df.groupby('location'):
        bhk_stats={}
        for bhk,bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk]={
                'mean': np.mean(bhk_df.price_per_sqft),
                'std':np.std(bhk_df.price_per_sqft),
                'count':bhk_df.shape[0]
            }
        for bhk,bhk_df in location_df.groupby('bhk'):
            stats=bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices=np.append(exclude_indices,bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')
data1=bhk_outlier_remover(data1)

In [100]:
data1.shape

(7358, 7)

In [101]:
data1

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,1st Block Jayanagar,4 BHK,2850.0,4.0,428.0,4,15017.543860
1,1st Block Jayanagar,3 BHK,1630.0,3.0,194.0,3,11901.840491
2,1st Block Jayanagar,3 BHK,1875.0,2.0,235.0,3,12533.333333
3,1st Block Jayanagar,3 BHK,1200.0,2.0,130.0,3,10833.333333
4,1st Block Jayanagar,2 BHK,1235.0,2.0,148.0,2,11983.805668
...,...,...,...,...,...,...,...
10278,other,2 BHK,1200.0,2.0,70.0,2,5833.333333
10279,other,1 BHK,1800.0,1.0,200.0,1,11111.111111
10282,other,2 BHK,1353.0,2.0,110.0,2,8130.081301
10283,other,1 Bedroom,812.0,1.0,26.0,1,3201.970443
10286,other,4 BHK,3600.0,5.0,400.0,4,11111.111111

In [102]:
data1.drop(columns=['size','price_per_sqft'],inplace=True)

**Cleaned Data**

In [103]:
data1.head()

              location  total_sqft  bath  price  bhk
0  1st Block Jayanagar      2850.0   4.0  428.0    4
1  1st Block Jayanagar      1630.0   3.0  194.0    3
2  1st Block Jayanagar      1875.0   2.0  235.0    3
3  1st Block Jayanagar      1200.0   2.0  130.0    3
4  1st Block Jayanagar      1235.0   2.0  148.0    2

In [104]:
data1.to_csv("Cleaned_data.csv")
X=data1.drop(columns=['price'])
Y=data1['price']

In [105]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model  import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [106]:
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,test_size=0.2,random_state=0)

In [107]:
print(X_train.shape)
print(X_test.shape)

(5886, 4)
(1472, 4)

# **Applying Linear Regression**

In [108]:
from sklearn.compose import make_column_transformer

column_trans=make_column_transformer((OneHotEncoder(sparse=False),['location']),remainder='passthrough')

In [109]:
scaler=StandardScaler()

In [110]:
lr=LinearRegression(normalize=True)
pipe=make_pipeline(column_trans,scaler,lr)

In [111]:
pipe.fit(X_train,Y_train)
Y_pred_lr=pipe.predict(X_test)
r2_score(Y_test,Y_pred_lr)

C:\Users\Dell\AppData\Roaming\Python\Python310\site-packages\sklearn\linear_model\_base.py:141: FutureWarning: 'normalize' was deprecated in version 1.0 and will be removed in 1.2.
If you wish to scale the data, use Pipeline with a StandardScaler in a preprocessing stage. To reproduce the previous behavior:

from sklearn.pipeline import make_pipeline

model = make_pipeline(StandardScaler(with_mean=False), LinearRegression())

If you wish to pass a sample_weight parameter, you need to pass it as a fit parameter to each step of the pipeline as follows:

kwargs = {s[0] + '__sample_weight': sample_weight for s in model.steps}
model.fit(X, y, **kwargs)


  warnings.warn(

0.8392045362078312

In [112]:
'''Lasso Regression'''
lasso=Lasso()
pipe=make_pipeline(column_trans,scaler,lasso)
pipe.fit(X_train,Y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('lasso', Lasso())])

In [113]:
Y_pred_lasso=pipe.predict(X_test)
#print(Y_pred_lasso)
r2_score(Y_test,Y_pred_lasso)

0.8315444728453546

In [114]:
import pickle
pickle.dump(pipe,open('bangalore_house_price2.pk1','wb'))

In [115]:
import json
columns = {'data_columns': [col.lower() for col in X['location'].unique().tolist()]}
with open("columns.json","w") as f:
    f.write(json.dumps(columns))
columns

{'data_columns': ['1st block jayanagar',
  '1st phase jp nagar',
  '2nd phase judicial layout',
  '2nd stage nagarbhavi',
  '5th block hbr layout',
  '5th phase jp nagar',
  '6th phase jp nagar',
  '7th phase jp nagar',
  '8th phase jp nagar',
  '9th phase jp nagar',
  'aecs layout',
  'abbigere',
  'akshaya nagar',
  'ambalipura',
  'ambedkar nagar',
  'amruthahalli',
  'anandapura',
  'ananth nagar',
  'anekal',
  'anjanapura',
  'ardendale',
  'arekere',
  'attibele',
  'beml layout',
  'btm 2nd stage',
  'btm layout',
  'babusapalaya',
  'badavala nagar',
  'balagere',
  'banashankari',
  'banashankari stage ii',
  'banashankari stage iii',
  'banashankari stage v',
  'banashankari stage vi',
  'banaswadi',
  'banjara layout',
  'bannerghatta',
  'bannerghatta road',
  'basavangudi',
  'basaveshwara nagar',
  'battarahalli',
  'begur',
  'begur road',
  'bellandur',
  'benson town',
  'bharathi nagar',
  'bhoganhalli',
  'billekahalli',
  'binny pete',
  'bisuvanahalli',
  'bommanahalli',
  'bommasandra',
  'bommasandra industrial area',
  'bommenahalli',
  'brookefield',
  'budigere',
  'cv raman nagar',
  'chamrajpet',
  'chandapura',
  'channasandra',
  'chikka tirupathi',
  'chikkabanavar',
  'chikkalasandra',
  'choodasandra',
  'cooke town',
  'cox town',
  'cunningham road',
  'dasanapura',
  'dasarahalli',
  'devanahalli',
  'devarachikkanahalli',
  'dodda nekkundi',
  'doddaballapur',
  'doddakallasandra',
  'doddathoguru',
  'domlur',
  'dommasandra',
  'epip zone',
  'electronic city',
  'electronic city phase ii',
  'electronics city phase 1',
  'frazer town',
  'gm palaya',
  'garudachar palya',
  'giri nagar',
  'gollarapalya hosahalli',
  'gottigere',
  'green glen layout',
  'gubbalala',
  'gunjur',
  'hal 2nd stage',
  'hbr layout',
  'hrbr layout',
  'hsr layout',
  'haralur road',
  'harlur',
  'hebbal',
  'hebbal kempapura',
  'hegde nagar',
  'hennur',
  'hennur road',
  'hoodi',
  'horamavu agara',
  'horamavu banaswadi',
  'hormavu',
  'hosa road',
  'hosakerehalli',
  'hoskote',
  'hosur road',
  'hulimavu',
  'isro layout',
  'itpl',
  'iblur village',
  'indira nagar',
  'jp nagar',
  'jakkur',
  'jalahalli',
  'jalahalli east',
  'jigani',
  'judicial layout',
  'kr puram',
  'kadubeesanahalli',
  'kadugodi',
  'kaggadasapura',
  'kaggalipura',
  'kaikondrahalli',
  'kalena agrahara',
  'kalyan nagar',
  'kambipura',
  'kammanahalli',
  'kammasandra',
  'kanakapura',
  'kanakpura road',
  'kannamangala',
  'karuna nagar',
  'kasavanhalli',
  'kasturi nagar',
  'kathriguppe',
  'kaval byrasandra',
  'kenchenahalli',
  'kengeri',
  'kengeri satellite town',
  'kereguddadahalli',
  'kodichikkanahalli',
  'kodigehaali',
  'kodigehalli',
  'kodihalli',
  'kogilu',
  'konanakunte',
  'koramangala',
  'kothannur',
  'kothanur',
  'kudlu',
  'kudlu gate',
  'kumaraswami layout',
  'kundalahalli',
  'lb shastri nagar',
  'laggere',
  'lakshminarayana pura',
  'lingadheeranahalli',
  'magadi road',
  'mahadevpura',
  'mahalakshmi layout',
  'mallasandra',
  'malleshpalya',
  'malleshwaram',
  'marathahalli',
  'margondanahalli',
  'marsur',
  'mico layout',
  'munnekollal',
  'murugeshpalya',
  'mysore road',
  'ngr layout',
  'nri layout',
  'nagarbhavi',
  'nagasandra',
  'nagavara',
  'nagavarapalya',
  'narayanapura',
  'neeladri nagar',
  'nehru nagar',
  'ombr layout',
  'old airport road',
  'old madras road',
  'padmanabhanagar',
  'pai layout',
  'panathur',
  'parappana agrahara',
  'pattandur agrahara',
  'poorna pragna layout',
  'prithvi layout',
  'r.t. nagar',
  'rachenahalli',
  'raja rajeshwari nagar',
  'rajaji nagar',
  'rajiv nagar',
  'ramagondanahalli',
  'ramamurthy nagar',
  'rayasandra',
  'sahakara nagar',
  'sanjay nagar',
  'sarakki nagar',
  'sarjapur',
  'sarjapur  road',
  'sarjapura - attibele road',
  'sector 2 hsr layout',
  'sector 7 hsr layout',
  'seegehalli',
  'shampura',
  'shivaji nagar',
  'singasandra',
  'somasundara palya',
  'sompura',
  'sonnenahalli',
  'subramanyapura',
  'sultan palaya',
  'tc palaya',
  'talaghattapura',
  'thanisandra',
  'thigalarapalya',
  'thubarahalli',
  'thyagaraja nagar',
  'tindlu',
  'tumkur road',
  'ulsoor',
  'uttarahalli',
  'varthur',
  'varthur road',
  'vasanthapura',
  'vidyaranyapura',
  'vijayanagar',
  'vishveshwarya layout',
  'vishwapriya layout',
  'vittasandra',
  'whitefield',
  'yelachenahalli',
  'yelahanka',
  'yelahanka new town',
  'yelenahalli',
  'yeshwanthpur',
  'other']}